test/zoo/inheritance/ddl/inheritance_1_ddl.dbml
Table ALIQUET {
  magna VARCHAR(42) [not null]
  tellus VARCHAR(42) [not null]
  Indexes {
    (magna, tellus) [pk]
  }
}

Table CONSEQUAT {
  fermentum VARCHAR(42) [pk, not null]
  dederit VARCHAR(42)
}

Table CURABITUR {
  gravida VARCHAR(42) [pk, not null]
  amor VARCHAR(42)
}

Table DIGNISSIM {
  tellus VARCHAR(42) [pk, not null]
  terra VARCHAR(42)
}

Table LACUS {
  magna VARCHAR(42) [pk, not null]
  tempor VARCHAR(42)
  fugit VARCHAR(42)
}

Table LIBERO {
  posuere VARCHAR(42) [pk, not null]
  lacrima VARCHAR(42)
}

Table NEC {
  magna VARCHAR(42) [pk, not null]
  pulvinar VARCHAR(42)
  audis VARCHAR(42)
  gravida VARCHAR(42) [not null]
}

Table QUAM {
  cras VARCHAR(42) [pk, not null]
  sed VARCHAR(42)
  magna VARCHAR(42) [not null]
}

Table SODALES {
  magna VARCHAR(42) [pk, not null]
  convallis VARCHAR(42)
  ipsum VARCHAR(42)
}

Table SUSCIPIT {
  orci VARCHAR(42) [pk, not null]
  lorem VARCHAR(42)
  magna VARCHAR(42) [not null]
}

Table TRISTIS {
  magna VARCHAR(42) [pk, not null]
  vestibulum VARCHAR(42)
  fermentum VARCHAR(42) [not null]
  type UNSIGNED_INT
}

Table ULTRICES {
  posuere VARCHAR(42) [not null]
  magna VARCHAR(42) [not null]
  Indexes {
    (posuere, magna) [pk]
  }
}

Ref:ALIQUET.magna > TRISTIS.magna
Ref:ALIQUET.tellus > DIGNISSIM.tellus
Ref:LACUS.magna > TRISTIS.magna
Ref:NEC.magna > TRISTIS.magna
Ref:NEC.gravida > CURABITUR.gravida
Ref:QUAM.magna > SODALES.magna
Ref:SODALES.magna > TRISTIS.magna
Ref:SUSCIPIT.magna > TRISTIS.magna
Ref:TRISTIS.fermentum > CONSEQUAT.fermentum
Ref:ULTRICES.posuere > LIBERO.posuere
Ref:ULTRICES.magna > LACUS.magna
